In [9]:
import pandas as pd

df = pd.read_csv('/Users/simonevitale/Desktop/amazon.csv')

print(df.shape)
print(df.columns)
df.sample(n=10)

(20000, 2)
Index(['reviewText', 'Positive'], dtype='object')

                                              reviewText  Positive
16267  its not that fun of a game and some times no m...         0
7970   At first the game is confusing but once you fi...         1
15672  I can't find the application on my Kindle and ...         0
284    I couldn't believe how this game drew me in.  ...         1
315    Great Graphics works great on my kindle fire h...         1
4841   Excellent calculator.  I especially like the p...         1
3549   I downloaded this game 3/20 and have not had a...         1
12373  I&apos;ve been using the free version for a wh...         1
8244   Raising grandchildren rarely gives me the oppo...         1
19991  great interactive game love playing it and so ...         1

In [10]:
df['Positive'].unique()

array([1, 0])

In [12]:
df['Positive'].value_counts()

Positive
1    15233
0     4767
Name: count, dtype: int64

In [23]:
df = pd.read_csv('/Volumes/SSD/EPICODE/PYTHON/ESERCITAZIONI/Dataset_Extra/beginner_datasets/diabetes.csv')

df.shape
df.columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                                                                    Non-Null Count  Dtype
---  ------                                                                    --------------  -----
 0   Number of times pregnant                                                  768 non-null    int64
 1   Plasma glucose concentration a 2 hours in an oral glucose tolerance test  768 non-null    int64
 2   Diastolic blood pressure (mm Hg)                                          768 non-null    int64
 3   Triceps skin fold thickness (mm)                                          768 non-null    int64
 4   2-Hour serum insulin (mu U/ml)                                            768 non-null    int64
 5   Body mass index (weight in kg/(height in m)^2)                            768 non-null    float64
 6   Diabetes pedigree function                                                768 non-null    float64
 7   Age (years)                                                               768 non-null    int64
 8   Class variable                                                            768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [26]:
df.describe()

       Number of times pregnant  ...  Class variable
count                768.000000  ...      768.000000
mean                   3.845052  ...        0.348958
std                    3.369578  ...        0.476951
min                    0.000000  ...        0.000000
25%                    1.000000  ...        0.000000
50%                    3.000000  ...        0.000000
75%                    6.000000  ...        1.000000
max                   17.000000  ...        1.000000

[8 rows x 9 columns]

In [27]:
df.head()

   Number of times pregnant  ...  Class variable
0                         6  ...               1
1                         1  ...               0
2                         8  ...               1
3                         1  ...               0
4                         0  ...               1

[5 rows x 9 columns]

In [4]:
filtro_1 = df['Age (years)'] >= 20
filtro_2 = df['Age (years)'] <= 29

filtro_tot = filtro_1 & filtro_2
fascia_20_29 = df[filtro_tot]
fascia_20_29

,Number of times pregnant,Plasma glucose concentration a 2 hours in an oral glucose tolerance test,Diastolic blood pressure (mm Hg),Triceps skin fold thickness (mm),2-Hour serum insulin (mu U/ml),Body mass index (weight in kg/(height in m)^2),Diabetes pedigree function,Age (years),Class variable
3,1,89,66,23,94,28.1,0.167,21,0
6,3,78,50,32,88,31.0,0.248,26,1
7,10,115,0,0,0,35.3,0.134,29,0
20,3,126,88,41,235,39.3,0.704,27,0
23,9,119,80,35,0,29.0,0.263,29,1
...,...,...,...,...,...,...,...,...,...
753,0,181,88,44,510,43.3,0.222,26,1
758,1,106,76,0,0,37.5,0.197,26,0
760,2,88,58,26,16,28.4,0.766,22,0
764,2,122,70,27,0,36.8,0.340,27,0
767,1,93,70,31,0,30.4,0.315,23,0

In [39]:
print(fascia_20_29.shape)

(396, 9)

In [40]:
fascia_20_29.head()

    Number of times pregnant  ...  Class variable
3                          1  ...               0
6                          3  ...               1
7                         10  ...               0
20                         3  ...               0
23                         9  ...               1

[5 rows x 9 columns]

In [2]:
import pandas as pd
df = pd.read_csv('/Volumes/SSD/EPICODE/PYTHON/ESERCITAZIONI/Dataset_Extra/beginner_datasets/diabetes.csv')

filtro_3 = df['Age (years)'] >= 30
filtro_4 = df['Age (years)'] <= 39
filtro_tot_2 = filtro_3 & filtro_4

fascia_30_39 = df[filtro_tot_2]
fascia_30_39

,Number of times pregnant,Plasma glucose concentration a 2 hours in an oral glucose tolerance test,Diastolic blood pressure (mm Hg),Triceps skin fold thickness (mm),2-Hour serum insulin (mu U/ml),Body mass index (weight in kg/(height in m)^2),Diabetes pedigree function,Age (years),Class variable
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
4,0,137,40,35,168,43.1,2.288,33,1
5,5,116,74,0,0,25.6,0.201,30,0
10,4,110,92,0,0,37.6,0.191,30,0
...,...,...,...,...,...,...,...,...,...
748,3,187,70,22,200,36.4,0.408,36,1
755,1,128,88,39,110,36.5,1.057,37,1
756,7,137,90,41,0,32.0,0.391,39,0
762,9,89,62,0,0,22.5,0.142,33,0
765,5,121,72,23,112,26.2,0.245,30,0

In [3]:
filtro_5 = df['Age (years)'] >= 40
filtro_6 = df['Age (years)'] <= 50

filtro_tot_3 = filtro_5 & filtro_6

fascia_40_50 = df[filtro_tot_3]
fascia_40_50

,Number of times pregnant,Plasma glucose concentration a 2 hours in an oral glucose tolerance test,Diastolic blood pressure (mm Hg),Triceps skin fold thickness (mm),2-Hour serum insulin (mu U/ml),Body mass index (weight in kg/(height in m)^2),Diabetes pedigree function,Age (years),Class variable
0,6,148,72,35,0,33.6,0.627,50,1
21,8,99,84,0,0,35.4,0.388,50,0
22,7,196,90,0,0,39.8,0.451,41,1
25,10,125,70,26,115,31.1,0.205,41,1
26,7,147,76,0,0,39.4,0.257,43,1
...,...,...,...,...,...,...,...,...,...
745,12,100,84,33,105,30.0,0.488,46,0
749,6,162,62,0,0,24.3,0.178,50,1
754,8,154,78,32,0,32.4,0.443,45,1
761,9,170,74,31,0,44.0,0.403,43,1
766,1,126,60,0,0,30.1,0.349,47,1

In [8]:
#Qual è la media della pressione sanguigna diastolica per le diverse fasce di età?

print(fascia_20_29['Diastolic blood pressure (mm Hg)'].mean(), fascia_20_29.shape)

65.34848484848484 (396, 9)

In [15]:
print(fascia_30_39['Diastolic blood pressure (mm Hg)'].mean(), fascia_30_39.shape)

69.66666666666667 (165, 9)

In [16]:
print(fascia_40_50['Diastolic blood pressure (mm Hg)'].mean(), fascia_40_50.shape)

74.21428571428571 (126, 9)

In [18]:
#Esercizio 3
df = pd.read_csv('/Volumes/SSD/EPICODE/PYTHON/ESERCITAZIONI/Dataset_Extra/beginner_datasets/insurance.csv')
df.shape

(1338, 7)

In [19]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [20]:
df.info

<bound method DataFrame.info of       age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]>

In [22]:
df.describe

<bound method NDFrame.describe of       age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]>

In [29]:
#Quali sono le medie di charges rispetto a region? Ci sono differenze significative

df.groupby('region')['charges'].mean().sort_values()

region
southwest    12346.937377
northwest    12417.575374
northeast    13406.384516
southeast    14735.411438
Name: charges, dtype: float64

In [30]:
#E rispetto a smoker? E a sex?

df.groupby('smoker')['charges'].mean()

smoker
no      8434.268298
yes    32050.231832
Name: charges, dtype: float64

In [31]:
df.groupby('sex')['charges'].mean()

sex
female    12569.578844
male      13956.751178
Name: charges, dtype: float64

In [32]:
df.groupby(['region', 'sex', 'smoker'])['charges'].mean()

region     sex     smoker
northeast  female  no         9640.426984
                   yes       28032.046398
           male    no         8664.042222
                   yes       30926.252583
northwest  female  no         8786.998679
                   yes       29670.824946
           male    no         8320.689321
                   yes       30713.181419
southeast  female  no         8440.205552
                   yes       33034.820716
           male    no         7609.003587
                   yes       36029.839367
southwest  female  no         8234.091260
                   yes       31687.988430
           male    no         7778.905534
                   yes       32598.862854
Name: charges, dtype: float64

In [33]:
#Quali sono i descrittori statistici di bmi? Quali sono minimo, media e massimo di charges rispetto ai diversi quartili dei valori di bmi?

df['bmi'].describe()

count    1338.000000
mean       30.663397
std         6.098187
min        15.960000
25%        26.296250
50%        30.400000
75%        34.693750
max        53.130000
Name: bmi, dtype: float64

In [42]:
filtro = df['bmi'] < 26.296250
gruppo_1 = df[filtro]
print(gruppo_1['charges'].min(), gruppo_1['charges'].mean(), gruppo_1['charges'].max())

1121.8739 10360.662825492538 38245.59327

In [43]:
filtro_2 = df['bmi'] >= 26.296250
filtro_3 = df['bmi'] <= 30.400000
gruppo_2 = df[filtro_2 & filtro_3]
print(gruppo_2['charges'].min(), gruppo_2['charges'].mean(), gruppo_2['charges'].max())

1131.5066 11407.831467689348 62592.87309

In [44]:
filtro_4 = df['bmi'] >= 30.400000
filtro_5 = df['bmi'] <= 34.693750
gruppo_3 = df[filtro_4 & filtro_5]
print(gruppo_3['charges'].min(), gruppo_3['charges'].mean(), gruppo_3['charges'].max())

1135.9407 14323.550841999999 60021.39897

In [45]:
filtro_6 = df['bmi'] > 34.693750
gruppo_4 = df[filtro_6]
print(gruppo_4['charges'].min(), gruppo_4['charges'].mean(), gruppo_4['charges'].max())

1141.4451 16987.936690955226 63770.42801

In [ ]:
#All'aumentare del BMI, i costi assicurativi crescono.

In [50]:
#Esercizio 4

df = pd.read_csv('/Volumes/SSD/EPICODE/PYTHON/ESERCITAZIONI/Dataset_Extra/beginner_datasets/pokemon.csv')
df.shape

(800, 13)

In [51]:
df.describe()

,#,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation
count,800.000000,800.00000,800.000000,800.000000,800.000000,800.000000,800.000000,800.000000,800.00000
mean,362.813750,435.10250,69.258750,79.001250,73.842500,72.820000,71.902500,68.277500,3.32375
std,208.343798,119.96304,25.534669,32.457366,31.183501,32.722294,27.828916,29.060474,1.66129
min,1.000000,180.00000,1.000000,5.000000,5.000000,10.000000,20.000000,5.000000,1.00000
25%,184.750000,330.00000,50.000000,55.000000,50.000000,49.750000,50.000000,45.000000,2.00000
50%,364.500000,450.00000,65.000000,75.000000,70.000000,65.000000,70.000000,65.000000,3.00000
75%,539.250000,515.00000,80.000000,100.000000,90.000000,95.000000,90.000000,90.000000,5.00000
max,721.000000,780.00000,255.000000,190.000000,230.000000,194.000000,230.000000,180.000000,6.00000

In [52]:
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [53]:
df.columns

Index(['#', 'Name', 'Type 1', 'Type 2', 'Total', 'HP', 'Attack', 'Defense',
       'Sp. Atk', 'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [56]:
df = df.set_index(df.columns[0])
df.head()

,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Name,,,,,,,,,,,
Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [57]:
#Quali sono i Pokémon leggendari?

df['Legendary'].unique()

array([False,  True])

In [60]:
filtro = df['Legendary'] == True
leggendari = df[filtro]
leggendari.shape

(65, 11)

In [61]:
leggendari.head()

,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Name,,,,,,,,,,,
Articuno,Ice,Flying,580,90,85,100,95,125,85,1,True
Zapdos,Electric,Flying,580,90,90,85,125,90,100,1,True
Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True
Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
MewtwoMega Mewtwo X,Psychic,Fighting,780,106,190,100,154,100,130,1,True

In [69]:
#quali sono i leggendari di tipo 1 Grass?

filtro = df['Legendary'] == True
filtro_2 = df['Type 1'] == 'Grass'
leggendari_grass = df[filtro & filtro_2]

leggendari_grass.shape
leggendari_grass.head()

,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Name,,,,,,,,,,,
ShayminLand Forme,Grass,NaN,600,100,100,100,100,100,100,4,True
ShayminSky Forme,Grass,Flying,600,100,103,75,120,75,127,4,True
Virizion,Grass,Fighting,580,91,90,72,90,129,108,5,True

In [76]:
#E leggendari di tipo 1 Ice o Fire?

filtro_leg = df['Legendary'] == True
filtro_ice = df['Type 1'] == 'Ice'
filtro_fire = df['Type 1'] == 'Fire'

filtro_tot = df[filtro_leg & (filtro_ice | filtro_fire)]
filtro_tot.shape
filtro_tot.head()

,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Name,,,,,,,,,,,
Articuno,Ice,Flying,580,90,85,100,95,125,85,1,True
Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True
Entei,Fire,NaN,580,115,115,85,90,75,100,2,True
Ho-oh,Fire,Flying,680,106,130,90,110,154,90,2,True
Regice,Ice,NaN,580,80,50,100,100,200,50,3,True

In [80]:
#Quali sono i Pokémon della prima generazione con attacco > 50 e HP < 60?

filtro_gen = df['Generation'] == 1
filtro_atk = df['Attack'] > 50
filtro_hp = df['HP'] < 60

filtro_tot = df[filtro_gen & filtro_atk & filtro_hp]
filtro_tot.shape
filtro_tot.head()

,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
Name,,,,,,,,,,,
Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
Charmeleon,Fire,NaN,405,58,64,58,80,65,80,1,False
Wartortle,Water,NaN,405,59,63,80,65,80,58,1,False
Rattata,Normal,NaN,253,30,56,35,25,35,72,1,False
Raticate,Normal,NaN,413,55,81,60,50,70,97,1,False

In [84]:
#Esercizio 5

df = pd.read_csv('/Volumes/SSD/EPICODE/PYTHON/ESERCITAZIONI/Dataset_Lezioni/dataset_es5/Mappa-dei-pub-circoli-locali-in-Italia.csv', encoding='latin1', sep=';')
df.head()
df.shape

(2635, 9)

In [86]:
df.columns

Index(['Comune', 'Provincia', 'Regione', 'Nome', 'Anno inserimento',
       'Data e ora inserimento', 'Identificatore in OpenStreetMap',
       'Longitudine', 'Latitudine'],
      dtype='object')

In [87]:
df.head(1)

,Comune,Provincia,Regione,Nome,Anno inserimento,Data e ora inserimento,Identificatore in OpenStreetMap,Longitudine,Latitudine
0,ALTRO,ALTRO,ALTRO,NaN,2011,2011-06-25T23:17:43Z,1339088150,13.733257,45.57583

In [89]:
df.tail(1)

,Comune,Provincia,Regione,Nome,Anno inserimento,Data e ora inserimento,Identificatore in OpenStreetMap,Longitudine,Latitudine
2634,TRANI,BARLETTA-ANDRIA-TRANI,Puglia,Well's Fargo,2009,2009-08-10T12:44:03Z,387223648,16.436765,41.267264

In [90]:
df.sample(1)

,Comune,Provincia,Regione,Nome,Anno inserimento,Data e ora inserimento,Identificatore in OpenStreetMap,Longitudine,Latitudine
2466,CORDENONS,PORDENONE,Friuli-Venezia Giulia,Snoopy Pub,2013,2013-02-19T07:59:48Z,2162292029,12.703148,45.995455

In [91]:
#Quali sono gli anni di inserimento presenti?

df['Anno inserimento'].unique()

array([2011, 2015, 2010, 2012, 2014, 2016, 2013, 2008, 2009, 2007])

In [99]:
filtro = df['Nome'].str.contains('enoteca|vino', case=False, na=False)
enoteche = df[filtro]
enoteche.shape

(9, 9)

In [100]:
enoteche

,Comune,Provincia,Regione,Nome,Anno inserimento,Data e ora inserimento,Identificatore in OpenStreetMap,Longitudine,Latitudine
64,TORINO,CITTA' METROPOLITANA DI TORINO,Piemonte,"Enoteca con Cucina""""Tirolin""""",2012,2012-01-24T14:30:04Z,1603586163,7.713993,45.065174
203,GENOVA,CITTA' METROPOLITANA DI GENOVA,Liguria,"Ai troeggi (vino, birra e bruschette)",2015,2015-10-24T21:21:48Z,2798235384,8.930549,44.407324
496,MILANO,CITTA' METROPOLITANA DI MILANO,Lombardia,Concordia Enoteca,2014,2014-04-01T11:15:38Z,2758108717,9.171033,45.450819
1003,MALO,VICENZA,Veneto,Enoteca Umberto,2013,2013-04-15T08:41:22Z,1659350138,11.418507,45.653453
1491,FERRARA,FERRARA,Emilia-Romagna,"Enoteca """"Al Brindisi""""",2015,2015-03-31T17:33:38Z,1249699754,11.620326,44.835890
1492,FERRARA,FERRARA,Emilia-Romagna,"Enoteca """"da Massimo""""",2015,2015-03-31T17:33:38Z,1249701207,11.619559,44.834824
1723,CASCIANA TERME LARI,PISA,Toscana,Enoteca Il Violino Rosso,2015,2015-08-20T13:12:56Z,3706561154,10.591535,43.566210
2100,FORIO,CITTA' METROPOLITANA DI NAPOLI,Campania,Grotta del vino,2014,2014-09-27T22:24:54Z,3099598334,13.861664,40.715224
2303,LECCE,LECCE,Puglia,RossoDivino,2012,2012-06-18T19:05:13Z,1793498795,18.190631,40.356215